[
    {
        "version": "0.892",
        "date": "21.08.2024, 11:00 Uhr",
        "title": "Intelligente Essensplanung & Einkaufslisten",
        "changes": [
            "**Vereinfachter Start:** Der Essensplaner startet jetzt mit einer Standard-Konfiguration (2 Erwachsene, 1 Kind), der Konfigurationsbildschirm wurde entfernt.",
            "**Persistente Einkaufslisten:** Ihre Einkaufsliste wird jetzt gespeichert! Abgehakte oder manuell hinzugefügte Artikel bleiben pro Woche erhalten.",
            "**Verbesserte Rezept-Erstellung:** Beim manuellen Hinzufügen von Rezepten können Sie jetzt direkt die Zutaten und die Anleitung detailliert eingeben.",
            "**Detaillierte Zutaten & 10 neue Rezepte:** Alle Rezepte enthalten nun Mengenangaben und die Datenbank wurde um 10 neue Gerichte erweitert, um das Kochen und Einkaufen zu erleichtern.",
            "**Optimierte Einkaufsliste:** Die Einkaufsliste zeigt nun direkt die benötigten Mengen an und fasst Zutaten für die Woche zusammen."
        ]
    },
    {
        "version": "0.878",
        "date": "20.08.2024, 09:00 Uhr",
        "title": "KI-gestützter Belegscanner & Gemini-Integration",
        "changes": [
            "**Belege intelligent scannen:** Fügen Sie Ausgaben jetzt noch schneller hinzu, indem Sie Belege mit Ihrer Kamera scannen oder als Bild hochladen. Die KI erkennt automatisch Betrag, Beschreibung und schlägt eine passende Kategorie vor.",
            "**Umstellung auf Gemini:** Die KI-Analyse wird nun durch das leistungsstarke Gemini-Modell von Google angetrieben, was für präzisere Ergebnisse sorgt.",
            "**Aktivierung in den Einstellungen:** Die neuen KI-Funktionen können in den allgemeinen Einstellungen aktiviert oder deaktiviert werden.",
            "**Verbesserte Schnelleingabe:** Die Schnelleingabe auf dem Dashboard wurde um die neuen KI-Buttons erweitert."
        ]
    },
    {
        "version": "0.865",
        "date": "19.08.2024, 10:00 Uhr",
        "title": "Erweiterte Transaktionsgruppen & UI-Verbesserungen",
        "changes": [
            "**Bestehende Gruppen erweitern:** Fügen Sie jetzt direkt aus der Detailansicht weitere Transaktionen zu einer bestehenden Gruppe hinzu.",
            "**Gruppen beitreten:** Einzelne Transaktionen können nun entweder eine neue Gruppe bilden oder einer bestehenden Gruppe beitreten.",
            "**Dynamische Neuberechnung:** Beim Hinzufügen oder Entfernen von Einträgen wird die Gruppensumme automatisch angepasst und die Beträge der nicht-korrigierten Posten neu verteilt.",
            "**Sanfte UI-Animation:** Beim Navigieren zwischen Transaktionen innerhalb einer Gruppe wird der Hauptbereich des Modals mit einer weichen Fade-Animation aktualisiert.",
            "**Optimierte Auswahl:** Die Transaktionsauswahl ist nun nach dem Erstellungsdatum sortiert, um die neuesten Einträge zuerst anzuzeigen."
        ]
    },
    {
        "version": "0.864",
        "date": "18.08.2024, 12:00 Uhr",
        "title": "Interaktive Transaktionsgruppen & Korrekturlogik",
        "changes": [
            "**Transaktionen direkt verknüpfen:** Im Detail-Modal einer Transaktion gibt es jetzt eine Funktion, um diese mit anderen Ausgaben zu einer Gruppe zu verbinden. Perfekt für Sammelbestellungen oder geteilte Rechnungen!",
            "**Automatische Umverteilung:** Ändern Sie den Betrag eines Postens in einer Gruppe. Die Differenz wird intelligent und proportional auf die restlichen, nicht-korrigierten Einträge verteilt, während die Gesamtsumme der Gruppe unverändert bleibt.",
            "**Korrektur-Modus:** Manuell angepasste Beträge werden als 'korrigiert' markiert und von der automatischen Verteilung ausgenommen. Eine Korrektur kann jederzeit zurückgesetzt werden.",
            "**Gruppenübersicht:** Das Detail-Modal zeigt alle Transaktionen einer Gruppe, den Soll- und den Ist-Betrag an. So behalten Sie immer den Überblick.",
            "**Gruppen bei Schnelleingabe:** Werden mehrere Posten per Komma eingegeben (z.B. 'Pizza, Salat'), werden diese automatisch zu einer Gruppe zusammengefasst."
        ]
    },
    {
        "version": "0.863",
        "date": "17.08.2024, 10:00 Uhr",
        "title": "Transaktionsgruppen & Intelligente Korrekturlogik",
        "changes": [
            "**Transaktionen gruppieren:** Fassen Sie zusammengehörige Ausgaben in einer Gruppe zusammen. Ideal für Sammelbestellungen oder Einkäufe, die aufgeteilt werden. Die Funktion finden Sie in der Detailansicht einer Transaktion.",
            "**Fixe Gruppensumme:** Der Gesamtbetrag einer Gruppe bleibt konstant. Ändern Sie den Betrag eines Eintrags, wird die Differenz automatisch auf die anderen, nicht-korrigierten Einträge verteilt.",
            "**Korrektur-Modus:** Geänderte Beträge werden als 'korrigiert' markiert. Die automatische Verteilung erfolgt nur auf die nicht-korrigierten Einträge, um manuelle Anpassungen zu schützen.",
            "**Flexible Verwaltung:** Fügen Sie Transaktionen zu bestehenden Gruppen hinzu, entfernen Sie sie oder setzen Sie Korrekturen zurück – alles direkt in der Detailansicht."
        ]
    },
    {
        "version": "0.862",
        "date": "16.08.2024, 11:00 Uhr",
        "title": "Transaktionsgruppen & Intelligente Korrekturlogik",
        "changes": [
            "**Transaktionen gruppieren:** Fassen Sie zusammengehörige Ausgaben in einer Gruppe zusammen. Ideal für Sammelbestellungen oder Einkäufe, die aufgeteilt werden. Die Funktion finden Sie in der Detailansicht einer Transaktion.",
            "**Fixe Gruppensumme:** Der Gesamtbetrag einer Gruppe bleibt konstant. Ändern Sie den Betrag eines Eintrags, wird die Differenz automatisch auf die anderen, nicht-korrigierten Einträge verteilt.",
            "**Korrektur-Modus:** Geänderte Beträge werden als 'korrigiert' markiert. Die automatische Verteilung erfolgt nur auf die nicht-korrigierten Einträge, um manuelle Anpassungen zu schützen.",
            "**Flexible Verwaltung:** Fügen Sie Transaktionen zu bestehenden Gruppen hinzu, entfernen Sie sie oder setzen Sie Korrekturen zurück – alles direkt in der Detailansicht."
        ]
    },
    {
        "version": "0.801",
        "date": "15.08.2024, 09:00 Uhr",
        "title": "Intelligente Synchronisierung & Multi-Geräte-Setup",
        "changes": [
            "**Nahtlose Geräte-Synchronisierung:** Der App-Modus (z.B. Demo vs. Standard) wird jetzt beim ersten Start auf einem neuen Gerät automatisch übernommen. Ihr Setup ist sofort auf allen Geräten konsistent.",
            "**Zuverlässigere Daten-Synchronisierung:** Die Logik für den Datenabgleich wurde grundlegend überarbeitet. Nach einer Synchronisierung werden lokale Daten sauber durch den Server-Stand ersetzt, was Duplikate bei der ID-Migration verhindert.",
            "**Architektur-Update & Performance:** Die App startet nun asynchron, um zuerst die Konfiguration zu laden. Dies verhindert UI-Flackern und sorgt für einen stabileren Start. Die API-Abfragen wurden für einen schnelleren Initial-Load optimiert."
        ]
    },
    {
        "version": "0.789",
        "date": "14.08.2024, 12:00 Uhr",
        "title": "Verbesserter Workflow & Detail-Bearbeitung",
        "changes": [
            "**Direktes Bearbeiten von Transaktionen:** Alle Details einer Transaktion (Betrag, Beschreibung, Datum, Benutzer, Tags) können jetzt direkt in der Detailansicht bearbeitet werden. Klicken Sie einfach auf das Detail, das Sie ändern möchten!",
            "**Sichereres Löschen von Kategorien:** Beim Löschen einer Kategorie mit zugeordneten Transaktionen werden Sie nun aufgefordert, diese einer anderen Kategorie zuzuweisen. So gehen keine Daten verloren.",
            "**Intelligente Benutzerauswahl:** Die App merkt sich jetzt den zuletzt ausgewählten Benutzer für den Demo- und den Produktiv-Modus separat, was den Wechsel erleichtert.",
            "**Performance-Optimierung:** Das Laden und Scrollen von langen Transaktionslisten wurde beschleunigt. Die App fühlt sich jetzt noch flüssiger an.",
            "**Neuer Farbwähler:** Der Standard-Farbwähler wurde durch eine modernere und intuitivere Komponente zum Anpassen von Benutzer- und Gruppenfarben ersetzt."
        ]
    },
    {
        "version": "0.600",
        "date": "13.08.2024, 10:00 Uhr",
        "title": "Architektur- & Performance-Update",
        "changes": [
            "**Schnellere Ladezeiten:** Die App startet jetzt deutlich schneller! Die Demo-Daten und dieser Changelog werden nur noch bei Bedarf geladen, was die anfängliche Download-Größe für alle Nutzer reduziert.",
            "**Verbesserte Code-Struktur:** Unter der Haube wurde die gesamte Anwendungsarchitektur modernisiert. Durch die neue, Feature-basierte Struktur ist der Code sauberer, besser organisiert und zukunftssicher.",
            "**Zuverlässigere Synchronisierung:** Die Logik für die Datensynchronisierung wurde von der Benutzeroberfläche entkoppelt. Das macht die Status-Benachrichtigungen robuster und zuverlässiger.",
            "**Code-Bereinigung:** Redundanter Code wurde entfernt und wiederverwendbare Komponenten (Buttons, Modals, etc.) wurden zentralisiert. Dies erhöht die Stabilität und Konsistenz der gesamten Anwendung."
        ]
    },
    {
        "version": "0.500",
        "date": "12.08.2024, 18:00 Uhr",
        "title": "Die große UI-Überarbeitung",
        "changes": [
            "**Komplett neues Einstellungsmenü:** Die Einstellungen erstrahlen in neuem Glanz! Ein modernes, responsives Zwei-Spalten-Layout sorgt für eine bessere Übersicht auf dem Desktop und eine optimale Bedienung auf dem Handy.",
            "**Zentralisierte Budgetverwaltung:** Die Reiter \"Budgets\" und \"Fixkosten\" wurden zu einem schlagkräftigen \"Budget\"-Tab zusammengefasst. Planen Sie jetzt alle Ihre Finanzen an einem Ort.",
            "**Neue Budget-Übersicht:** Sehen Sie auf einen Blick, wie sich Ihr Gesamtbudget auf flexible Ausgaben und Fixkosten verteilt. Ein neuer Balken visualisiert das Verhältnis und hilft Ihnen, Ihre Finanzen besser zu verstehen.",
            "**Verbesserte Navigation:** Beim Wechseln zwischen den Hauptreitern (Übersicht, Transaktionen etc.) wird die Ansicht nun automatisch nach ganz oben gescrollt.",
            "**Optimierte Kategorie-Auswahl:** Die Schnellauswahl der Kategorien wurde überarbeitet. Der neue \"+\"-Button ist kompakter und fügt sich nahtlos in das Design ein.",
            "**Feinschliff & Korrekturen:** Diverse kleine Verbesserungen, wie z.B. in der Kalenderansicht der Statistiken, sorgen für ein runderes Gesamterlebnis."
        ]
    }
]
