[
    {
        "version": "0.819",
        "date": "16.08.2024, 11:00 Uhr",
        "title": "Visuelle Harmonie & frische Icons",
        "changes": [
            "**Einheitliches Design:** Der \"Kategorie bearbeiten\"-Dialog wurde komplett überarbeitet und sieht jetzt genauso elegant aus wie die Gruppen-Anpassung. Das sorgt für ein ruhigeres und intuitiveres Bedienerlebnis.",
            "**Neuer Icon-Stil:** Alle Icons in der App – von Transaktionen über Kategorien bis hin zu Gruppen – haben einen frischen Look erhalten. Das neue Design ist klarer, moderner und verbessert die Übersichtlichkeit in der gesamten Anwendung."
        ]
    },
    {
        "version": "0.801",
        "date": "15.08.2024, 09:00 Uhr",
        "title": "Intelligente Synchronisierung & Multi-Geräte-Setup",
        "changes": [
            "**Nahtlose Geräte-Synchronisierung:** Der App-Modus (z.B. Demo vs. Standard) wird jetzt beim ersten Start auf einem neuen Gerät automatisch übernommen. Ihr Setup ist sofort auf allen Geräten konsistent.",
            "**Zuverlässigere Daten-Synchronisierung:** Die Logik für den Datenabgleich wurde grundlegend überarbeitet. Nach einer Synchronisierung werden lokale Daten sauber durch den Server-Stand ersetzt, was Duplikate bei der ID-Migration verhindert.",
            "**Architektur-Update & Performance:** Die App startet nun asynchron, um zuerst die Konfiguration zu laden. Dies verhindert UI-Flackern und sorgt für einen stabileren Start. Die API-Abfragen wurden für einen schnelleren Initial-Load optimiert."
        ]
    },
    {
        "version": "0.789",
        "date": "14.08.2024, 12:00 Uhr",
        "title": "Verbesserter Workflow & Detail-Bearbeitung",
        "changes": [
            "**Direktes Bearbeiten von Transaktionen:** Alle Details einer Transaktion (Betrag, Beschreibung, Datum, Benutzer, Tags) können jetzt direkt in der Detailansicht bearbeitet werden. Klicken Sie einfach auf das Detail, das Sie ändern möchten!",
            "**Sichereres Löschen von Kategorien:** Beim Löschen einer Kategorie mit zugeordneten Transaktionen werden Sie nun aufgefordert, diese einer anderen Kategorie zuzuweisen. So gehen keine Daten verloren.",
            "**Intelligente Benutzerauswahl:** Die App merkt sich jetzt den zuletzt ausgewählten Benutzer für den Demo- und den Produktiv-Modus separat, was den Wechsel erleichtert.",
            "**Performance-Optimierung:** Das Laden und Scrollen von langen Transaktionslisten wurde beschleunigt. Die App fühlt sich jetzt noch flüssiger an.",
            "**Neuer Farbwähler:** Der Standard-Farbwähler wurde durch eine modernere und intuitivere Komponente zum Anpassen von Benutzer- und Gruppenfarben ersetzt."
        ]
    },
    {
        "version": "0.600",
        "date": "13.08.2024, 10:00 Uhr",
        "title": "Architektur- & Performance-Update",
        "changes": [
            "**Schnellere Ladezeiten:** Die App startet jetzt deutlich schneller! Die Demo-Daten und dieser Changelog werden nur noch bei Bedarf geladen, was die anfängliche Download-Größe für alle Nutzer reduziert.",
            "**Verbesserte Code-Struktur:** Unter der Haube wurde die gesamte Anwendungsarchitektur modernisiert. Durch die neue, Feature-basierte Struktur ist der Code sauberer, besser organisiert und zukunftssicher.",
            "**Zuverlässigere Synchronisierung:** Die Logik für die Datensynchronisierung wurde von der Benutzeroberfläche entkoppelt. Das macht die Status-Benachrichtigungen robuster und zuverlässiger.",
            "**Code-Bereinigung:** Redundanter Code wurde entfernt und wiederverwendbare Komponenten (Buttons, Modals, etc.) wurden zentralisiert. Dies erhöht die Stabilität und Konsistenz der gesamten Anwendung."
        ]
    },
    {
        "version": "0.500",
        "date": "12.08.2024, 18:00 Uhr",
        "title": "Die große UI-Überarbeitung",
        "changes": [
            "**Komplett neues Einstellungsmenü:** Die Einstellungen erstrahlen in neuem Glanz! Ein modernes, responsives Zwei-Spalten-Layout sorgt für eine bessere Übersicht auf dem Desktop und eine optimale Bedienung auf dem Handy.",
            "**Zentralisierte Budgetverwaltung:** Die Reiter \"Budgets\" und \"Fixkosten\" wurden zu einem schlagkräftigen \"Budget\"-Tab zusammengefasst. Planen Sie jetzt alle Ihre Finanzen an einem Ort.",
            "**Neue Budget-Übersicht:** Sehen Sie auf einen Blick, wie sich Ihr Gesamtbudget auf flexible Ausgaben und Fixkosten verteilt. Ein neuer Balken visualisiert das Verhältnis und hilft Ihnen, Ihre Finanzen besser zu verstehen.",
            "**Verbesserte Navigation:** Beim Wechseln zwischen den Hauptreitern (Übersicht, Transaktionen etc.) wird die Ansicht nun automatisch nach ganz oben gescrollt.",
            "**Optimierte Kategorie-Auswahl:** Die Schnellauswahl der Kategorien wurde überarbeitet. Der neue \"+\"-Button ist kompakter und fügt sich nahtlos in das Design ein.",
            "**Feinschliff & Korrekturen:** Diverse kleine Verbesserungen, wie z.B. in der Kalenderansicht der Statistiken, sorgen für ein runderes Gesamterlebnis."
        ]
    }
]
